package com.example.yangchunghsuan.project;

public class buildingGPS {
    String building_list[] = {"資訊電機館","圖書館","商學大樓","科學與航太館","紀念館",
            "行政二館","行政大樓","忠勤樓","建築館","語文大樓",
            "工學館","體育館", "人言大樓","人文社會館","電子通訊館",
            "第一招待所","育樂館","理學大樓","土木水利館","學思樓"};
    String gps_list[] = {"24.179208, 120.649689","24.178677, 120.648887","24.178386, 120.649811","24.178265, 120.649083","24.178327, 120.648258",
            "24.178646, 120.647696","24.178562, 120.647040","24.179203, 120.647018","24.179524, 120.646769", "24.179749, 120.647013",
            "24.179342, 120.647871","24.181600, 120.648770", "24.179696, 120.648638","24.179797, 120.649315","24.179824, 120.649825",
            "24.179761, 120.647720","24.180241, 120.646962","24.181001, 120.647711","24.181039, 120.646876","24.181662, 120.646718"};

    public String[] getGps_list() {
        return gps_list;
    }

    public String getBuilding(int index) {
        return building_list[index];
    }
}
